config-datatypes/src/test/resources/simple.body.txt

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To soapenv:mustUnderstand="true">http://localhost:8888/sim/default__rr/reg/rb</wsa:To><wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:C89E58CCC1CB32365E1503483101985</wsa:MessageID><wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegisterDocumentSet-b</wsa:Action></soapenv:Header><soapenv:Body><lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"><rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><rim:ExtrinsicObject id="Document01" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" mimeType="text/plain">
   <rim:Slot name="repositoryUniqueId">
      <rim:ValueList>
         <rim:Value>1.1.4567332.1.42</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="hash">
      <rim:ValueList>
         <rim:Value>e543712c0e10501972de13a5bfcbe826c49feb75</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="size">
      <rim:ValueList>
         <rim:Value>36</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="creationTime">
      <rim:ValueList>
         <rim:Value>20061224</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="languageCode">
      <rim:ValueList>
         <rim:Value>en-us</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="serviceStartTime">
      <rim:ValueList>
         <rim:Value>200612230800</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="serviceStopTime">
      <rim:ValueList>
         <rim:Value>200612230900</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="sourcePatientId">
      <rim:ValueList>
         <rim:Value>89765a87b^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="sourcePatientInfo">
      <rim:ValueList>
         <rim:Value>PID-3|pid1^^^&amp;1.2.3&amp;ISO</rim:Value>
         <rim:Value>PID-5|Doe^John^^^</rim:Value>
         <rim:Value>PID-7|19560527</rim:Value>
         <rim:Value>PID-8|M</rim:Value>
         <rim:Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Name>
      <rim:LocalizedString value="DocF"/>
   </rim:Name>
   <rim:Description/>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_1">
      <rim:Slot name="authorPerson">
         <rim:ValueList>
            <rim:Value>^Smitty^Gerald^^^</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorInstitution">
         <rim:ValueList>
            <rim:Value>Cleveland Clinic</rim:Value>
            <rim:Value>Parma Community</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorRole">
         <rim:ValueList>
            <rim:Value>Attending</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorSpecialty">
         <rim:ValueList>
            <rim:Value>Orthopedic</rim:Value>
         </rim:ValueList>
      </rim:Slot>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_2">
      <rim:Slot name="authorPerson">
         <rim:ValueList>
            <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorInstitution">
         <rim:ValueList>
            <rim:Value>Cleveland Clinic</rim:Value>
            <rim:Value>Berea Community</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorRole">
         <rim:ValueList>
            <rim:Value>Primary Surgon</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorSpecialty">
         <rim:ValueList>
            <rim:Value>Orthopedic</rim:Value>
         </rim:ValueList>
      </rim:Slot>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="DEMO-Ext Summary" classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_3">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Summary for External / Non Clinical Use"/>
      </rim:Name>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="N" classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_4">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>2.16.840.1.113883.5.25</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Normal"/>
      </rim:Name>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="urn:ihe:rad:TEXT" classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_5">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>1.3.6.1.4.1.19376.1.2.3</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="urn:ihe:rad:TEXT"/>
      </rim:Name>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="Outpatient" classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_6">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>Connect-a-thon healthcareFacilityTypeCodes</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Outpatient"/>
      </rim:Name>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="Dialysis" classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_7">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>Connect-a-thon practiceSettingCodes 2</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Dialysis"/>
      </rim:Name>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="T-62002" classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_8">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>SNM3</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Liver"/>
      </rim:Name>
   </rim:Classification>
   <rim:Classification classifiedObject="Document01" nodeRepresentation="XTHM-WD TYPECODE" classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_9">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="XTHM-WD TYPECODE"/>
      </rim:Name>
   </rim:Classification>
   <rim:ExternalIdentifier value="P20170823030905.2^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_10" registryObject="Document01">
      <rim:Name>
         <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
      </rim:Name>
   </rim:ExternalIdentifier>
   <rim:ExternalIdentifier value="1.42.20170823061126.13" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_11" registryObject="Document01">
      <rim:Name>
         <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
      </rim:Name>
   </rim:ExternalIdentifier>
</rim:ExtrinsicObject><rim:RegistryPackage id="SubmissionSet01" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
   <rim:Slot name="submissionTime">
      <rim:ValueList>
         <rim:Value>20041225235050</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Name>
      <rim:LocalizedString value="Physical"/>
   </rim:Name>
   <rim:Description>
      <rim:LocalizedString value="Annual physical"/>
   </rim:Description>
   <rim:Classification classifiedObject="SubmissionSet01" nodeRepresentation="" classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_12">
      <rim:Slot name="authorPerson">
         <rim:ValueList>
            <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorInstitution">
         <rim:ValueList>
            <rim:Value>Cleveland Clinic</rim:Value>
            <rim:Value>Berea Community</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorRole">
         <rim:ValueList>
            <rim:Value>Primary Surgon</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorSpecialty">
         <rim:ValueList>
            <rim:Value>Orthopedic</rim:Value>
         </rim:ValueList>
      </rim:Slot>
   </rim:Classification>
   <rim:Classification classifiedObject="SubmissionSet01" nodeRepresentation="34133-9" classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_13">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>2.16.840.1.113883.6.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Summary of Episode Note"/>
      </rim:Name>
   </rim:Classification>
   <rim:ExternalIdentifier value="1.42.20170823061126.14" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_14" registryObject="SubmissionSet01">
      <rim:Name>
         <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
      </rim:Name>
   </rim:ExternalIdentifier>
   <rim:ExternalIdentifier value="1.3.6.1.4.1.21367.4" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_15" registryObject="SubmissionSet01">
      <rim:Name>
         <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
      </rim:Name>
   </rim:ExternalIdentifier>
   <rim:ExternalIdentifier value="P20170823030905.2^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_16" registryObject="SubmissionSet01">
      <rim:Name>
         <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
      </rim:Name>
   </rim:ExternalIdentifier>
</rim:RegistryPackage><rim:Classification classifiedObject="SubmissionSet01" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" id="ID_897927719_1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/><rim:Association targetObject="Document01" sourceObject="SubmissionSet01" associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="ID_897927719_2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association">
   <rim:Slot name="SubmissionSetStatus">
      <rim:ValueList>
         <rim:Value>Original</rim:Value>
      </rim:ValueList>
   </rim:Slot>
</rim:Association><rim:Association targetObject="urn:uuid:639ff453-5a56-46a6-9408-d6685d919739" sourceObject="Document01" associationType="urn:ihe:iti:2007:AssociationType:RPLC" id="ID_897927719_3" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association"/></rim:RegistryObjectList></lcm:SubmitObjectsRequest></soapenv:Body></soapenv:Envelope>